<?php

use App\Http\Controllers\ReviewsController;
use App\Models\Domain;
use App\Models\Property;
use Illuminate\Support\Facades\Artisan;
use Illuminate\Support\Facades\Http;
use Illuminate\Support\Facades\Route;
use Illuminate\Support\Facades\Storage;
use Illuminate\Support\Str;
use Mcamara\LaravelLocalization\Facades\LaravelLocalization;

Route::get('new', function() {
    $mileage = preg_replace('/[^0-9]/', '', '111,021 км');
    dd($mileage);
});

Route::get('cat', function () {

//    $categories = [
//        'acura' => ['title' => 'Купить авто Acura из США в #country# | Bex Auto', 'description' => 'Продажа б/у автомобилей Acura из Америки: купить машину Акура из США в #country# стоимостью от $5000 ✔️Доступные цены ✔️ Растаможка и оформление! ✔️ Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Автомобили Acura из США'],
//        'audi' => ['title' => 'Audi из США: Ауди из США под заказ и в #country#', 'description' => 'Купить Audi из США под заказ: Ауди из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Audi из США'],
//        'bentley' => ['title' => 'Автомобили Bentley из США под заказ', 'description' => '', 'h1' => 'Bentley'],
//        'bmw-motocikly' => ['title' => 'Купить мотоцикл BMW с США в #country# | Bex Auto', 'description' => 'Продажа мотоциклов BMW БУ из Америки в Украину от 2000 $ ✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли BMW з США'],
//        'bmw' => ['title' => 'BMW из США: БМВ из США под заказ и в #country#', 'description' => 'Купить BMW из США под заказ: БМВ из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили BMW из США'],
//        'buick' => ['title' => 'Buick из США: Бьюик из США в #country# | Bex Auto', 'description' => 'Продажа машин Buick БУ из Америки в #country# от 2000$ ✔️ Растаможка и оформление! Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Автомобили Buick из США'],
//        'cadillac' => ['title' => 'Cadillac из США: Кадиллак из США в #country# | Bex Auto', 'description' => 'Продажа машин Cadillac б/у из Америки: купить Американский Кадиллак в #country# стоимостью от $5000 ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка! ✔️️️ Доступные цены.', 'h1' => 'Автомобили Cadillac из США'],
//        'changcheng' => ['title' => 'Автомобили Changcheng из США под заказ', 'description' => '', 'h1' => 'Changcheng'],
//        'chevrolet' => ['title' => 'Автомобили Chevrolet из США: Шевроле из Америки под заказ или в #country#', 'description' => 'Купить Chevrolet в #country# или Шевроле под заказ из США: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобили Chevrolet из США'],
//        'chrysler' => ['title' => 'Chrysler из США: Крайслер из США в #country# | Bex Auto', 'description' => 'Продажа б/у автомобилей Chrysler из Америки: купить машину Крайслер из США в #country# от $4000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка!', 'h1' => 'Автомобили Chrysler из США'],
//        'dodge' => ['title' => 'Dodge из США: Додж из США в #country# | Bex Auto', 'description' => 'Продажа БУ автомобилей Dodge из Америки: купить Американский автомобиль Додж в #country# стоимостью от $6000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Консультации от специалистов! ⚡ Быстрая доставка!', 'h1' => 'Автомобили Dodge из США'],
//        'ducati' => ['title' => 'Мотоциклы Ducati из США на заказ', 'description' => 'Купить мотоцикл Ducati с США✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли Ducati з США'],
//        'ferrari' => ['title' => 'Автомобили Ferrari из США под заказ', 'description' => 'Купить американский Ферари в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Топовая комплектация', 'h1' => 'Автомобили Ferrari из США'],
//        'fiat' => ['title' => 'Автомобили Fiat из США: Фиат из Америки в #country# и под заказ', 'description' => 'Купить машину Fiat из Америки в #country# или Фиат под заказ из США: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобили Fiat из США'],
//        'ford' => ['title' => 'Автомобили Ford из США: Форд из Америки в #country# и под заказ', 'description' => 'Купить Ford в #country# или Форд под заказ из США: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобілі Форд з США'],
//        'geely' => ['title' => 'Автомобили Geely из США под заказ', 'description' => '', 'h1' => 'Geely'],
//        'gmc' => ['title' => 'Купить автомобиль GMC из США в #country# | Bex Auto', 'description' => 'Продажа авто GMC из Америки: купить Джи Эм Си из США в #country# стоимостью от $4000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка!', 'h1' => 'Автомобили GMC из США'],
//        'harley-davidson' => ['title' => 'Купить мотоцикл Harley Davidson с США: Харлей Дэвидсон из Америки в Украину | Bex Auto', 'description' => 'Продажа мотоциклов Harley Davidson. Б / У и новые мотоциклы из Америки в Украину. Стоимость мотоцикла Harley Davidson от $ 2000 ✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли Harley Davidson з США'],
//        'honda-motocikly' => ['title' => 'Купить мотоцикл Honda с США Американский мотоцикл Хонда в #country# | Bex Auto', 'description' => 'Продажа мотоциклов Honda: купить б / у мотоцикл Хонда из Америки в Украину. Цена мотоциклов Honda от $ 2000 ✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли Honda з США'],
//        'honda' => ['title' => 'Honda из США: Хонда из США под заказ и в #country#', 'description' => 'Купить Honda из США под заказ: Хонда из Америки в #country#: ✔️ Доступные цены ✔️ Кредит на покупку ✔️ Доставка ✔️ Растаможка ✔️ Сертификация ✔️ Постановка на учет.', 'h1' => 'Автомобили Honda из США'],
//        'hyundai' => ['title' => 'Hyundai из США: Хюндай из США под заказ и в #country#', 'description' => 'Купить Hyundai из США под заказ: Хюндай из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Hyundai из США'],
//        'indian-motorcycles' => ['title' => 'Мотоциклы INDIAN MOTORCYCLE из США на заказ', 'description' => 'Купить мотоцикл Indian Motorcycle из Америки в Украину ✔️ Доступная цена ✔️ Кредит на покупку ✔️На номерах ☎ +38 (067) 440 46 10', 'h1' => 'Мотоцикли INDIAN MOTORCYCLE з США'],
//        'infiniti' => ['title' => 'Infiniti из США: Инфинити из США под заказ', 'description' => 'Купить Infiniti из США под заказ: Инфинити из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Infiniti из США'],
//        'jaguar' => ['title' => 'Автомобили Jaguar из США под заказ', 'description' => 'Купить авто Ягуар из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Автомобили Jaguar из США'],
//        'jeep' => ['title' => 'Купить автомобиль Jeep из США в #country# | Bex Auto', 'description' => 'Продажа авто Jeep из Америки: купить Американские Джипы в #country# стоимостью от $5000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка!', 'h1' => 'Автомобили Jeep из США'],
//        'kawasaki' => ['title' => 'Купить мотоцикл Kawasaki с США в #country# | Bex Auto', 'description' => 'Продажа мотоциклов Kawasaki (Кавасаки) БУ из Америки в Украину от 2000 $ ✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли Kawasaki з США'],
//        'kia' => ['title' => 'KIA из США: КИА из США под заказ и в #country#', 'description' => 'Купить KIA из США под заказ: КИА из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили KIA из США'],
//        'lamborghini' => ['title' => 'Автомобили Lamborghini из США под заказ', 'description' => 'Купить американское Ламборгини в #country# с Bex Auto ✔️ Низкие цены ✔️ Топовая комплектация ✔️ Консультации при подборе ☎ +380674404610', 'h1' => 'Автомобили Lamborghini из США'],
//        'land-rover' => ['title' => 'Автомобили LAND ROVER из США под заказ', 'description' => '', 'h1' => 'LAND ROVER'],
//        'lexus' => ['title' => 'Автомобили Lexus из США: Лексус из Америки под заказ и в #country#', 'description' => 'Купить Lexus из США под заказ: Лексус из Америки в #country#: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобили Lexus из США'],
//        'lincoln' => ['title' => 'Купить авто Lincoln из США в #country# | Bex Auto', 'description' => 'Продажа машин Lincoln б/у из Америки: купить Американский Линкольн в #country# стоимостью от $5000 ✔️ Растаможка и оформление! ✔️ Помощь в подборе!', 'h1' => 'Автомобили Lincoln из США'],
//        'maserati' => ['title' => 'Автомобили Maserati из США под заказ', 'description' => 'Купить авто Мазерати из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Maserati'],
//        'mazda' => ['title' => 'Mazda из США: Мазда из США под заказ и в #country#', 'description' => 'Купить Mazda из США под заказ: Мазда из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Mazda из США'],
//        'mercedes' => ['title' => 'Автомобили Mercedes из США под заказ', 'description' => 'Купить авто Мерседес из Америки в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ ☎ +380674404610', 'h1' => 'Автомобили Mercedes из США'],
//        'mini-cooper' => ['title' => 'Mini Cooper из США: Мини Купер из США под заказ', 'description' => 'Купить Mini Cooper из США под заказ: Мини Купер из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Mini Cooper из США'],
//        'mitsubishi' => ['title' => 'Купить авто Mitsubishi из США в #country# | Bex Auto', 'description' => 'Продажа б/у машин Mitsubishi из Америки: купить автомобиль Мицубиси в #country# стоимостью от $4000 ✔️ Доступные цены✔️ Растаможка и оформление! Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Автомобили Mitsubishi из США'],
//        'nissan' => ['title' => 'Nissan из США: Ниссан из США под заказ и в #country#', 'description' => 'Купить Nissan из США под заказ: Ниссан из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Nissan из США'],
//        'porsche' => ['title' => 'Автомобили Porsche из США под заказ', 'description' => 'Купить американский Порше в #country# с Bex Auto ✔️ Топовая комплектация ✔️ Кредит на покупку ☎ +380674404610', 'h1' => 'Автомобили Porsche из США'],
//        'ram' => ['title' => 'Купить автомобиль RAM из США в #country# | Bex Auto', 'description' => 'Продажа машин б/у автомобилей RAM из Америки: купить Американский автомобиль RAM в #country# стоимостью от $ 4000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка!', 'h1' => 'Автомобили RAM из США'],
//        'range-rover' => ['title' => 'Автомобили Range Rover из США под заказ', 'description' => 'Купить американский Рендж Ровер в #country# с Bex Auto ✔️ Кредит на покупку ✔️ Топовая комплектация ☎ +380674404610', 'h1' => 'Автомобили Range Rover из США'],
//        'renault' => ['title' => 'Автомобили Renault из США под заказ', 'description' => 'Купить авто Рено из Америки в #country# ✔️ Доступная стоимость ✔️ Консультации при подборе ✔️ Кредит на покупку ☎ +380674404610', 'h1' => 'Автомобили Renault из США'],
//        'subaru' => ['title' => 'Купить автомобиль Subaru из США в #country# | Bex Auto', 'description' => 'Продажа Б/У машин Subaru из Америки в #country# стоимостью от $5000 ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! ✔️️️ Помощь в подборе! ✔️️️ Оперативная доставка!', 'h1' => 'Автомобили Subaru из США'],
//        'suzuki' => ['title' => 'Suzuki из США: Сузуки из США под заказ', 'description' => 'Купить Suzuki из США под заказ: Сузуки из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Быстрая доставка ✔️️Растаможка ✔️️Сертификация ✔️️Помощь в подборе.', 'h1' => 'Автомобиль Suzuki из США'],
//        'tesla' => ['title' => 'Автомобили Tesla из США под заказ', 'description' => 'Купить Теслу из Америки в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Топовая комплектация ☎ +380674404610', 'h1' => 'Автомобили Tesla из США'],
//        'toyota' => ['title' => 'Toyota из США: Тойота из США под заказ и в #country#', 'description' => 'Купить Toyota из США под заказ: Тойота из Америки в #country#: ✔️️Доступные цены ✔️️Кредит на покупку ✔️️Доставка ✔️️Растаможка ✔️️Сертификация ✔️️Постановка на учет.', 'h1' => 'Автомобили Toyota из США'],
//        'victory-motorcycles' => ['title' => 'Купить Victory Motorcycles с США в #country# | Bex Auto', 'description' => 'Продажа мотоциклов Victory Motorcycles БУ из Америки в Украину от 2000 $ ✔️ Растаможка и оформление! Помощь! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли Victory Motorcycles з США'],
//        'volkswagen' => ['title' => 'Volkswagen из США: Фольксваген из США в #country# | Bex Auto', 'description' => 'Продажа машин Volkswagen в #country# или под заказ Фольксваген из США: ✔️️️ Доступные цены ✔️️️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка.', 'h1' => 'Автомобили Volkswagen из США'],
//        'volvo' => ['title' => 'Автомобили Volvo из США под заказ', 'description' => '', 'h1' => 'Автомобили Volvo из США'],
//        'yamaha' => ['title' => 'Купить мотоцикл Yamaha с США в #country# | Bex Auto', 'description' => 'Продажа б / у мотоциклов Yamaha из Америки: купить мотоцикл Ямаха в #country# стоимостью от $ 5000 ✔️ Доступные цены ✔️ Растаможка и оформление! ✔️Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Мотоцикли YAMAHA з США'],
//        'avto-dlya-taksi' => ['title' => 'Авто под такси в #country# | Купить авто для такси под заказ', 'description' => 'Купить новые авто в кредит под такси в #country#. Каталог БУ авто для такси из Кореи и США. Легко найти, сравнить цены, характеристики и купить авто для таксиС пробегом', 'h1' => 'Авто для Такси'],
//        'avto-iz-korei' => ['title' => 'Авто из Кореи. Купить авто из Кореи - Bex Auto', 'description' => 'Авто из Кореи в #country#. Продажа корейских автомобилей с аукционов в Корее ✔️ Авто с растаможкой и сертификацией ✔️ Кредит на машину ✔️ Профессиональный подбор', 'h1' => 'Авто из Кореи'],
//        'aukcion-avto-iz-korei' => ['title' => 'Автомобили из Кореи под заказ от Bex Auto', 'description' => 'Авто из Кореи под заказ. Более 500 машин в автосалонах Одессы. Автомобили из Кореи под заказ. Профессиональная проверка перед торгами', 'h1' => 'Авто под заказ из Кореи'],
//        'boats' => ['title' => 'Купить лодки и катера с США в #country#: цена | Bex Auto', 'description' => 'Продажа водного транспорта (лодки, яхта, катер, скутеры, гидроциклы) с США в #country# ✅ Растаможка и сертификация ✅ Низкая стоимость ☎ +38 (067) 440 46 10.', 'h1' => 'Водный транспорт'],
//        'aukcion-avto-iz-ssha' => ['title' => 'Аукціон авто з США - купити машину на аукціоні в США | Bex Auto', 'description' => 'Продаж автомобілів з американських аукціонів в #country#: ✔️ БУ автомобілі з Америки під замовлення. Викуп ➔ Доставка ➔ Супровід ➔ Розмитнення машини на замовлення з Америки. ✔️ Доступні ціни на авто з США!', 'h1' => 'Аукцион авто из США'],
//        'avto-iz-ssha' => ['title' => 'Авто из США в наличии в #country#: Авто из США в #country#', 'description' => 'Автомобиль из США в наличии в #country#: ✔️ Авто с растаможкой и сертификацией ✔️ В наличии БУ и новые машины из Америки ✔️ Доступные цены на машины из США!', 'h1' => 'Авто из США в наличии'],
//        'elektromobili-iz-ssha' => ['title' => 'Электромобили из США в #country# и под заказ | Bex Auto', 'description' => 'В поисках электромобиля из Америки? Bex Auto- официальный представитель американских аукционов в #country#. Электромобили из США под заказ и в #country#', 'h1' => 'Електромобілі з США'],
//        'gruzovye-i-passazhirskie' => ['title' => 'Грузовые и пассажирские авто. Пассажирские авто', 'description' => 'Продажа грузовых и пассажирских автоС пробегом в #country# - купить БУ грузовик на сайте Bex Auto. Пассажирские авто от Bex Auto!', 'h1' => 'Грузовые и пассажирские'],
//        'mashiny-v-more' => ['title' => 'Bex Auto Автомобили из США в наличии и под заказ Машины в море - Bex Auto', 'description' => 'Автомобили из США в наличии и под заказ', 'h1' => 'Машины в море'],
//        'motocikly' => ['title' => 'Купить мотоциклы из США в #country# - под ключ, с аукциона, цена', 'description' => 'Мотоциклы из Америки в Украину: ✔️ Помощь в подборе мотоциклов с США ✔️ Оперативная доставка БУ мотоциклов из Штатов ✔️ Растаможка ✔️ Доступные цены на мотоциклы с США!', 'h1' => 'Мотоцикли з США'],
//        'arenda-avto' => ['title' => 'Аренда машин в Одессе -  посуточно недорого', 'description' => 'Каршеринг в Одессе недорого. Аренда автомобилей в Одессе от Bex Auto', 'h1' => 'Аренда авто в Одессе'],
//        'pogruzchiki' => ['title' => 'Вилочные погрузчики. Купить погрузчики в #country#', 'description' => 'Продажа новых вилочных погрузчиков по выгодным ценам в #country#. В наличии дизельные погрузчики, газовые и электропогрузчики с гарантией на Bex Auto', 'h1' => 'Погрузчики'],
//        'elektromobili' => ['title' => 'Купить электромобиль в #country#. Электромобили в #country# и под заказ - Bex Auto', 'description' => 'Продажа новых электромобилей: Купить электрокар в #country# и под заказ ✔️ Доступные цены✔️ Растаможка и оформление! ✔️ Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Электромобили'],
//        'furgon' => ['title' => 'Купить Фургон БУ из Америки в #country# | Bex Auto', 'description' => 'Продажа фургонов из США в #country# ✔️️️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Фургон'],
//        'gibridy' => ['title' => 'Гибридные авто из США в #country# | Bex Auto', 'description' => 'Купить авто Гибрид из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Гибриды под заказ из США'],
//        'hetchbek' => ['title' => 'Купить Хэтчбек БУ из Америки в #country# | Bex Auto', 'description' => 'Продажа хэтчбеков из США в #country# ✔️️️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Автомобили Хэтчбек из США'],
//        'kabriolet' => ['title' => 'Купить Кабриолет БУ из Америки в #country# | Bex Auto', 'description' => 'Продажа кабриолетов из США в #country# ✔️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Кабриолеты под заказ из США'],
//        'krossovery-i-vnedorozhniki' => ['title' => 'Купить внедорожники, кроссоверы из США в #country# или под заказ | Bex Auto', 'description' => 'Купить кроссоверы и внедорожники из США под заказ: Внедорожники и кроссоверы из Америки в #country#: ✔️ Доступные цены ✔️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Кроссоверы и внедорожники из США'],
//        'kruizer' => ['title' => 'Мотоциклы Круизер из США в #country# | Bex Auto', 'description' => 'Купить мотоциклы Круизер из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Круизер'],
//        'kupe' => ['title' => 'Купить купе из США в #country# - низкая цена, под ключ | Bex Auto', 'description' => 'Купэ из Америки в #country# под ключ ✔️ Доступная цена ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ На украинских номерах!', 'h1' => 'Купе'],
//        'miniven' => ['title' => 'Минивэн Купить авто из США и Кореи в #country# - Bex Auto', 'description' => 'Купить американский минивэн в #country# с Bex Auto ✔️ Топовая комплектация ✔️ Доступная стоимость ☎ +380674404610', 'h1' => 'Минивэны под заказ из США'],
//        'pikap' => ['title' => 'Купить американский пикап в #country# | Bex Auto', 'description' => 'Пикап из США в #country# от Bex Auto ✔️ Доступная стоимость ✔️ Помощь в подборе ✔️ Страховка машин ☎ +380674404610', 'h1' => 'Пикапы под заказ из США'],
//        'sedan' => ['title' => 'Седан БУ из Америки в #country# | Bex Auto', 'description' => 'Продажа седанов из США в #country# ✔️️️ Растаможка и оформление! Консультации от специалистов! ⚡ Быстрая доставка', 'h1' => 'Автомобили Седан из США'],
//        'universal' => ['title' => 'Универсал Купить авто из США и Кореи в #country# - Bex Auto', 'description' => '', 'h1' => 'Универсал'],
//        ];

//    $categoriesUa = [
//        'acura' => ['title' => 'Купить авто Acura из США в #country# | Bex Auto', 'description' => 'Продажа б/у автомобилей Acura из Америки: купить машину Акура из США в #country# стоимостью от $5000 ✔️Доступные цены ✔️ Растаможка и оформление! ✔️ Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Автомобили Acura из США'],
//        'audi' => ['title' => 'Audi з США: Ауді з Америки під замовленя і в #country#', 'description' => 'Купити Audi з США під замовлення: Ауді з Америки в #country#:✔️️Кредит на покупку ✔️️Доставка ✔️️Розмитнення ✔️️Сертифікація ✔️️Постановка на облік.', 'h1' => 'Автомобили Audi из США'],
//        'bentley' => ['title' => 'Автомобили Bentley из США под заказ', 'description' => '', 'h1' => 'Bentley'],
//        'bmw-motocikly' => ['title' => 'Купити мотоцикл BMW з США в #country# | Bex Auto', 'description' => 'Продаж мотоциклів BMW БУ з Америки в Україну от 2000 $ ✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли BMW з США'],
//        'bmw' => ['title' => 'BMW з США: БМВ з Америки під замовленя і в #country#', 'description' => 'Купити BMW з США під замовлення: БМВ з Америки в #country#:✔️️Кредит на покупку ✔️️Доставка ✔️️Розмитнення ✔️️Сертифікація ✔️️Постановка на облік.', 'h1' => 'Автомобили BMW из США'],
//        'buick' => ['title' => 'Buick з США: Бюік з Америки в #country# | Bex Auto', 'description' => 'Продаж вживаних Buick з Америки в #country# від 2000 $ ✔️ Розмитнення і оформлення! Допомога в підборі! ✔️ Оперативна доставка!', 'h1' => 'Автомобили Buick из США'],
//        'byd' => ['title' => 'Автомобили BYD из США под заказ', 'description' => '', 'h1' => 'BYD'],
//        'cadillac' => ['title' => 'Cadillac з США: Каділак з Америки в #country# | Bex Auto', 'description' => 'Продаж вживаних авто Cadillac з Америки: купити Американський Каділлак в #country# вартістю від $ 5000 ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка! ✔️️️ Доступні ціни.', 'h1' => 'Автомобили Cadillac из США'],
//        'changcheng' => ['title' => 'Автомобили Changcheng из США под заказ', 'description' => '', 'h1' => 'Changcheng'],
//        'chevrolet' => ['title' => 'Автомобілі Chevrolet з США: Шевроле з Америки під замовлення або в #country#', 'description' => 'Купити Chevrolet в #country# або Шевроле під замовлення з США: ✔Доступние ціни ✔Кредіт на покупку ✔Доставка ✔Растаможка ✔Сертіфікація ✔Постановка на облік.', 'h1' => 'Автомобили Chevrolet из США'],
//        'chrysler' => ['title' => 'Chrysler з США: Крайслер з Америки в #country# | Bex Auto', 'description' => 'Продаж вживаних автомобілів Chrysler з Америки: купити машину Крайслер з США в #country# від $ 4000 ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка!', 'h1' => 'Автомобили Chrysler из США'],
//        'dodge' => ['title' => 'Dodge з США: Додж з Америки в #country# | Bex Auto', 'description' => 'Продаж вживаних автомобілів Dodge з Америки: купити Американський автомобіль Додж в #country# вартістю від $ 6000. ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Консультації від фахівців! ⚡ Швидка доставка!', 'h1' => 'Автомобили Dodge из США'],
//        'ducati' => ['title' => 'Мотоцикли Ducati з США на замовлення', 'description' => 'Купити мотоцикл Ducati з США✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли Ducati з США'],
//        'ferrari' => ['title' => 'Автомобили Ferrari из США под заказ', 'description' => 'Купить американский Ферари в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Топовая комплектация', 'h1' => 'Автомобили Ferrari из США'],
//        'fiat' => ['title' => 'Автомобили Fiat из США: Фиат из Америки в #country# и под заказ', 'description' => 'Купить машину Fiat из Америки в #country# или Фиат под заказ из США: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобили Fiat из США'],
//        'ford' => ['title' => 'Автомобілі Ford з США: Форд з Америки в #country# та під замовлення', 'description' => 'Купити Ford в #country# або Форд під замовлення з США: ✔Доступние ціни ✔Кредіт на покупку ✔Доставка ✔Растаможка ✔Сертіфікація ✔Постановка на облік.', 'h1' => 'Автомобілі Форд з США'],
//        'geely' => ['title' => 'Автомобили Geely из США под заказ', 'description' => '', 'h1' => 'Geely'],
//        'gmc' => ['title' => 'Купити автомобіль GMC з США в #country# | Bex Auto', 'description' => 'Продаж авто GMC з Америки: купити Джі Ем Сі з США в #country# вартістю від $ 4000 ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка!', 'h1' => 'Автомобили GMC из США'],
//        'harley-davidson' => ['title' => 'Купити мотоцикл Harley Davidson з США: Харлей Девідсон з Америки в Україну | Bex Auto', 'description' => 'Продаж мотоциклів Harley Davidson. Б / У і нові мотоцикли з Америки в Україну. Вартість мотоцикла Harley Davidson від $ 2000 ✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли Harley Davidson з США'],
//        'honda-motocikly' => ['title' => 'Купити мотоцикл Honda з США Американський мотоцикл Хонда в #country# | Bex Auto', 'description' => 'Продаж мотоциклів Honda: купити б / у мотоцикл Хонда з Америки в Україну. Ціна мотоциклів Honda від $ 2000 ✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли Honda з США'],
//        'honda' => ['title' => 'Honda з США: Хонда з Америки під замовленя і в #country#', 'description' => 'Купити Honda з США під замовлення: Хонда з Америки в #country#: ✔️ Доступні ціни ✔️ Кредит на купівлю ✔️ Доставка ✔️ Розмитнення ✔️ Сертифікація ✔️ Постановка на облік.', 'h1' => 'Автомобили Honda из США'],
//        'hyundai' => ['title' => 'Hyundai з США: Хьондай з Америки під замовленя і в #country#', 'description' => 'Купити Hyundai з США під замовлення: Хьондай з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Hyundai из США'],
//        'indian-motorcycles' => ['title' => 'Мотоцикли INDIAN MOTORCYCLE з США на замовлення', 'description' => 'Купити мотоцикл Indian Motorcycle з Америки в #country# ✔️ Доступна ціна ✔️ Кредит на купівлю ✔️На номерах ☎ +38 (067) 440 46 10', 'h1' => 'Мотоцикли INDIAN MOTORCYCLE з США'],
//        'infiniti' => ['title' => 'Infiniti з США: Інфініті з Америки під замовленя', 'description' => 'Купити Infiniti з США під замовлення: Інфініті з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Infiniti из США'],
//        'jaguar' => ['title' => 'Автомобили Jaguar из США под заказ', 'description' => 'Купить авто Ягуар из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Автомобили Jaguar из США'],
//        'jeep' => ['title' => 'Купити автомобіль Jeep з США в #country# | Bex Auto', 'description' => 'Продаж авто Jeep з Америки: купити Американські Джипи в #country# вартістю від $5000 ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка!', 'h1' => 'Автомобили Jeep из США'],
//        'kawasaki' => ['title' => 'Купити мотоцикл Kawasaki з США в #country# | Bex Auto', 'description' => 'Продаж мотоциклів Kawasaki (Кавасакі) БО з Америки в Україну от 2000 $ ✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли Kawasaki з США'],
//        'kia' => ['title' => 'KIA з США: КІА з Америки під замовленя і в #country#', 'description' => 'Купити KIA з США під замовлення: КІА з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили KIA из США'],
//        'lamborghini' => ['title' => 'Автомобили Lamborghini из США под заказ', 'description' => 'Купить американское Ламборгини в #country# с Bex Auto ✔️ Низкие цены ✔️ Топовая комплектация ✔️ Консультации при подборе ☎ +380674404610', 'h1' => 'Автомобили Lamborghini из США'],
//        'land-rover' => ['title' => 'Автомобили LAND ROVER из США под заказ', 'description' => '', 'h1' => 'LAND ROVER'],
//        'lexus' => ['title' => 'Автомобили Lexus из США: Лексус из Америки под заказ и в #country#', 'description' => 'Купить Lexus из США под заказ: Лексус из Америки в #country#: ✔Доступные цены ✔Кредит на покупку ✔Доставка ✔Растаможка ✔Сертификация ✔Постановка на учет.', 'h1' => 'Автомобили Lexus из США'],
//        'lincoln' => ['title' => 'Купить авто Lincoln из США в #country# | Bex Auto', 'description' => 'Продажа машин Lincoln б/у из Америки: купить Американский Линкольн в #country# стоимостью от $5000 ✔️ Растаможка и оформление! ✔️ Помощь в подборе!', 'h1' => 'Автомобили Lincoln из США'],
//        'maserati' => ['title' => 'Автомобили Maserati из США под заказ', 'description' => 'Купить авто Мазерати из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Maserati'],
//        'mazda' => ['title' => 'Mazda з США: Мазда з Америки під замовленя і в #country#', 'description' => 'Купити Mazda з США під замовлення: Мазда з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Mazda из США'],
//        'mercedes' => ['title' => 'Автомобили Mercedes из США под заказ', 'description' => 'Купить авто Мерседес из Америки в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ ☎ +380674404610', 'h1' => 'Автомобили Mercedes из США'],
//        'mini-cooper' => ['title' => 'Mini Cooper з США: Міні Купер з Америки під замовленя', 'description' => 'Купити Mini Cooper з США під замовлення: Мини Купер з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Mini Cooper из США'],
//        'mitsubishi' => ['title' => 'Купить авто Mitsubishi из США в #country# | Bex Auto', 'description' => 'Продажа б/у машин Mitsubishi из Америки: купить автомобиль Мицубиси в #country# стоимостью от $4000 ✔️ Доступные цены✔️ Растаможка и оформление! Помощь в подборе! ✔️ Оперативная доставка!', 'h1' => 'Автомобили Mitsubishi из США'],
//        'nissan' => ['title' => 'Nissan з США: Ніссан з Америки під замовленя і в #country#', 'description' => 'Купити Nissan з США під замовлення: Ніссан з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Nissan из США'],
//        'porsche' => ['title' => 'Автомобили Porsche из США под заказ', 'description' => 'Купить американский Порше в #country# с Bex Auto ✔️ Топовая комплектация ✔️ Кредит на покупку ☎ +380674404610', 'h1' => 'Автомобили Porsche из США'],
//        'ram' => ['title' => 'Купити автомобіль RAM з США в #country#', 'description' => 'Продаж машин вживаних авто RAM з Америки: купити Американський автомобіль RAM в #country# вартістю від $ 4000 ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка!', 'h1' => 'Автомобили RAM из США'],
//        'range-rover' => ['title' => 'Автомобили Range Rover из США под заказ', 'description' => 'Купить американский Рендж Ровер в #country# с Bex Auto ✔️ Кредит на покупку ✔️ Топовая комплектация ☎ +380674404610', 'h1' => 'Автомобили Range Rover из США'],
//        'renault' => ['title' => 'Автомобили Renault из США под заказ', 'description' => 'Купить авто Рено из Америки в #country# ✔️ Доступная стоимость ✔️ Консультации при подборе ✔️ Кредит на покупку ☎ +380674404610', 'h1' => 'Автомобили Renault из США'],
//        'subaru' => ['title' => 'Купити автомобіль Subaru з США в #country# | Bex Auto', 'description' => 'Продаж машин вживаних авто Subaru з Америки в #country# вартістю від $ 5000 ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! ✔️️️ Допомога в підборі! ✔️️️ Оперативна доставка!', 'h1' => 'Автомобили Subaru из США'],
//        'suzuki' => ['title' => 'Suzuki з США: Сузукі з Америки під замовленя', 'description' => 'Купити Suzuki з США під замовлення: Сузукі з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Швидка доставка ✔️️️Сертифікація ✔️️️Допомога в підборі.', 'h1' => 'Автомобиль Suzuki из США'],
//        'tesla' => ['title' => 'Автомобили Tesla из США под заказ', 'description' => 'Купить Теслу из Америки в #country# с Bex Auto ✔️ Доступная стоимость ✔️ Топовая комплектация ☎ +380674404610', 'h1' => 'Автомобили Tesla из США'],
//        'toyota' => ['title' => 'Toyota з США: Тойота з Америки під замовленя і в #country#', 'description' => 'Купити Toyota з США під замовлення: Тойота з Америки в #country#: ✔️️️Доступні ціни ✔️️️Кредит на покупку ✔️️️Доставка ✔️️️Сертифікація ✔️️️Постановка на облік.', 'h1' => 'Автомобили Toyota из США'],
//        'victory-motorcycles' => ['title' => 'Купити Victory Motorcycles з США в #country# | Bex Auto', 'description' => 'Продаж мотоциклів Victory Motorcycles БО з Америки в Україну от 2000 $ ✔️ Розмитнення і оформлення! Допомога! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли Victory Motorcycles з США'],
//        'volkswagen' => ['title' => 'Volkswagen з США: Вольксваген з Америки в #country# | Bex Auto', 'description' => 'Продаж машин Volkswagen в #country# або під замовлення Вольксваген з США: ✔️️️ Доступні ціни ✔️️️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка.', 'h1' => 'Автомобили Volkswagen из США'],
//        'volvo' => ['title' => 'Автомобили Volvo из США под заказ', 'description' => '', 'h1' => 'Автомобили Volvo из США'],
//        'yamaha' => ['title' => 'Купити мотоцикл Yamaha з США в #country# | Bex Auto', 'description' => 'Продаж б / у мотоциклів Yamaha з Америки: купити мотоцикл Ямаха в #country# вартістю від $ 5000 ✔️ Доступні ціни ✔️ Розмитнення і оформлення! ✔️Помощь в підборі! ✔️ Оперативна доставка!', 'h1' => 'Мотоцикли YAMAHA з США'],
//        'avto-dlya-taksi' => ['title' => 'Авто для таксі в #country# | Купити авто для таксі на замовлення', 'description' => 'Купити нові авто у кредит для таксі в #country#. Каталог вживаних авто для таксі з Кореї та США. Легко знайти, порівняти ціни, характеристики та купити авто для таксі з пробігом', 'h1' => 'Авто для Такси'],
//        'avto-iz-korei' => ['title' => 'Авто з Кореї. Купити авто з Кореї - Bex Auto', 'description' => 'Авто з Кореї в #country#. Продаж корейських автомобілів з аукціонів в Кореї ✔️ Авто з розмитненням і сертифікацією ✔️ Кредит на машину ✔️ Професійний підбір', 'h1' => 'Авто з Кореї'],
//        'aukcion-avto-iz-korei' => ['title' => 'Автомобілі з Кореї на замовлення від Bex Auto', 'description' => 'Авто з Кореї на замовлення. Понад 500 машин в автосалонах Одеси. Автомобілі з Кореї на замовлення. Професійна перевірка перед торгами', 'h1' => 'Авто под заказ из Кореи'],
//        'aukcion-avto-iz-ssha' => ['title' => 'Аукціон авто з США - купити машину на аукціоні в США | Bex Auto', 'description' => 'Продаж автомобілів з американських аукціонів в #country#: ✔️ БУ автомобілі з Америки під замовлення. Викуп ➔ Доставка ➔ Супровід ➔ Розмитнення машини на замовлення з Америки. ✔️ Доступні ціни на авто з США!', 'h1' => 'Аукцион авто из США'],
//        'avto-iz-ssha' => ['title' => 'Автомобіль з США в наявності: авто з Америки в #country#', 'description' => 'Автомобіль з США в наявності в #country#: ✔️ Авто з розмитненням і сертифікацією ✔️ В наявності уживані та нові машини з Америки ✔️ Доступні ціни на машини з США!', 'h1' => 'Авто из США в наличии'],
//        'elektromobili-iz-ssha' => ['title' => 'Електромобілі з США в #country# та під замовлення | Bex Auto', 'description' => 'У пошуках електромобіля з Америки? Bex Auto - офіційний представник американських аукціонів в #country#. Електромобілі з США на замовлення та в #country#', 'h1' => 'Електромобілі з США'],
//        'gibridy' => ['title' => 'Купити Гібриди з США і Кореї в #country# та на замовлення', 'description' => 'Гібриди із США, Кореї під ключ в наявності та на замовлення. Гібриди та plug-in гібриди в #country#. Замовити вживані електро та гібриди зі США', 'h1' => 'Гібриди'],
//        'gruzovye-i-passazhirskie' => ['title' => 'Вантажні та пасажирські авто. Вантажні авто. Пасажирські авто', 'description' => 'Продаж вантажних та пасажирських авто з пробігом в #country# - купити вживану вантажівку на сайті Bex Auto. Пасажирські авто від Bex Auto!', 'h1' => 'Грузовые и пассажирские'],
//        'koreya-vykl' => ['title' => 'Bex Auto Автомобили из США в наличии и под заказ Корея выкл - Bex Auto', 'description' => 'Автомобили из США в наличии и под заказ', 'h1' => 'Корея выкл'],
//        'mashiny-v-more' => ['title' => 'Bex Auto Автомобили из США в наличии и под заказ Машини в морі - Bex Auto', 'description' => 'Автомобили из США в наличии и под заказ', 'h1' => 'Машины в море'],
//        'motorcycles' => ['title' => 'Купить мотоциклы из США в #country# - под ключ, с аукциона, цена', 'description' => 'Мотоциклы из Америки в Украину: ✔️ Помощь в подборе мотоциклов с США ✔️ Оперативная доставка БУ мотоциклов из Штатов ✔️ Растаможка ✔️ Доступные цены на мотоциклы с США!', 'h1' => 'Мотоцикли з США'],
//        'rent' => ['title' => 'Оренда машин в Одесі - подобово, недорого | Bex Auto', 'description' => 'Каршерінг авто в Одесі від компанії Bex Auto - ✔️ Ціни від 20 $ ✔️ОСАГО для авто! Для оренди телефонуйте +38 (067) 440 46 10', 'h1' => 'Аренда авто в Одессе'],
//        'specztehnika' => ['title' => 'Вилочные погрузчики. Купить погрузчики в #country#', 'description' => 'Продажа новых вилочных погрузчиков по выгодным ценам в #country#. В наличии дизельные погрузчики, газовые и электропогрузчики с гарантией на Bex Auto', 'h1' => 'Навантажувачі'],
//        'elektromobili' => ['title' => 'Купити електромобіль в #country#. Електромобілі в #country# та під замовлення - Bex Auto', 'description' => 'Продаж нових електромобілів: Купити електрокар в #country# та під замовлення ✔️ Доступні цени✔️ Розмитнення і оформлення! ✔️ Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Электромобили'],
//        'furgon' => ['title' => 'Купити Фургон БУ з Америки в #country# | Bex Auto', 'description' => 'Продаж фургонів з США в #country# ✔️️️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Фургон'],
//        'hetchbek' => ['title' => 'Купити Хетчбек БУ з Америки в #country# | Bex Auto', 'description' => 'Продаж хетчбеків з США в #country# ✔️️️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Автомобили Хэтчбек из США'],
//        'kabriolet' => ['title' => 'Купити Кабріолет БУ з Америки в #country# | Bex Auto', 'description' => 'Продаж кабріолетів з США в #country# ✔️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Кабриолеты под заказ из США'],
//        'krossovery-i-vnedorozhniki' => ['title' => 'Купити позашляховики, кросовери з США в #country# або під замовлення | Bex Auto', 'description' => 'Купити кросовери і позашляховики з США на замовлення: Позашляховики і кроссовери з Америки в #country#: ✔️ Доступні ціни ✔️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Кроссоверы и внедорожники из США'],
//        'kruizer' => ['title' => 'Мотоциклы Круизер из США в #country# | Bex Auto', 'description' => 'Купить мотоциклы Круизер из Америки в #country# ✔️ Доступная стоимость ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ Помощь в подборе', 'h1' => 'Круїзер'],
//        'kupe' => ['title' => 'Купить купе из США в #country# - низкая цена, под ключ | Bex Auto', 'description' => 'Купэ из Америки в #country# под ключ ✔️ Доступная цена ✔️ Кредит на покупку ✔️ Топовая комплектация ✔️ На украинских номерах!', 'h1' => 'Купе'],
//        'miniven' => ['title' => 'Мінівен з США в #country# - Bex Auto', 'description' => 'Купить американский минивэн в #country# с Bex Auto ✔️ Топовая комплектация ✔️ Доступная стоимость ☎ +380674404610', 'h1' => 'Минивэны под заказ из США'],
//        'pikap' => ['title' => 'Купить американский пикап в #country# | Bex Auto', 'description' => 'Пикап из США в #country# от Bex Auto ✔️ Доступная стоимость ✔️ Помощь в подборе ✔️ Страховка машин ☎ +380674404610', 'h1' => 'Пикапы под заказ из США'],
//        'sedan' => ['title' => 'Седан БУ з Америки в #country# | Bex Auto', 'description' => 'Продаж седанів з США в #country# ✔️️️ Розмитнення і оформлення! Консультації від фахівців! ⚡ Швидка доставка', 'h1' => 'Автомобили Седан из США'],
//        'universal' => ['title' => 'Універсал Купить авто из США и Кореи в #country# - Bex Auto', 'description' => '', 'h1' => 'Універсал'],
//        ];

//    foreach ($categories as $slug => $category) {
//        $categoryModel = \App\Models\Category::query()->where('slug', $slug)->first();
//        // if exist
//        if ($categoryModel) {
//            $categoryModel->update([
//                'meta_title' => $category['title'],
//                'meta_description' => $category['description'],
//                'h1' => $category['h1'],
//                'locale' => 'ru'
//            ]);
//        } else {
//            $res = \App\Models\Category::create([
//                'slug' => $slug,
//                'title' => $category['h1'],
//                'meta_title' => $category['title'],
//                'meta_description' => $category['description'],
//                'h1' => $category['h1'],
//                'locale' => 'ru'
//            ]);
//            dump($res);
//        }
//    }

});

Route::get('news-import', function () {
    // Импорт новостей запустить превым
//    $response = Http::get('https://bexhilltrading.net/b2b/?test=y');
//    $body = $response->body();
//    $news = json_decode($body, true);
//    foreach ($news as $article) {
//        $filename = '';
//        if (strlen($article['picture']) > 0) {
//            $imageData = file_get_contents($article['picture']);
//            $filename = 'news/' . uniqid() . '.jpg';
//            Storage::put( $filename, $imageData);
//        }
//        $res = \App\Models\News::create([
//            'active' => 1,
//            'title' => $article['h1'],
//            'meta_title' => $article['meta_title'],
//            'meta_description' => $article['meta_description'],
//            'detail_text' => $article['text'],
//            'slug' => $article['slug'],
//            'image' => $filename,
//            'locale' => 'ru'
//        ]);
//        dump($res);
//    }
//    die();

    // Очистка всех новостей
//    $news = \App\Models\News::query()->get();
//    foreach ($news as $article) {
//        $article->delete();
//    }

    // Добавление ua зыка
//    $response = Http::get('https://bexhilltrading.net/ua/b2b/?test=y');
//    $body = $response->body();
//    $news = json_decode($body, true);
//    foreach ($news as $article) {
//        $res = \App\Models\News::query()
//            ->where('slug', $article['slug'])->first();
//
//
//        $res->update([
//            'title' => $article['h1'],
//            'meta_title' => $article['meta_title'],
//            'meta_description' => $article['meta_description'],
//            'detail_text' => $article['text'],
//            '_locale' => 'uk'
//        ]);
//        dump($res);
//    }
});

Route::get('cars', function() {

    $categoriesMap = [
        'avto-dlya-taksi' => 'avto-dlya-taksi',
        'avto-iz-korei' => 'avto-iz-korei',
        'avto-pod-zakaz-iz-korei' => 'aukcion-avto-iz-korei',
        'avto-v-ukraine' => 'avto-iz-ssha',
        'boats' => 'boats',
        'cars-under' => 'aukcion-avto-iz-ssha',
        'cars' => 'avto-iz-ssha',
        'elektromobili-iz-ssha' => 'elektromobili-iz-ssha',
        'elektromobili' => 'elektromobili',
        'gibridy' => 'gibridy',
        'gruzovye-i-passazhirskie' => 'gruzovye-i-passazhirskie',
        'koreya-vykl' => 'aukcion-avto-iz-korei',
        'mashiny-v-more' => 'mashiny-v-more',
        'motorcycles' => 'motocikly',
        'parser' => 'aukcion-avto-iz-ssha',
        'rent' => 'arenda-avto',
        'specztehnika' => 'pogruzchiki',
    ];


    foreach ($categoriesMap as $slug => $categorySlug) {
        $current = 0;
        $paged = 1;

        $query = ['test' => 'y', 'cars' => 'y', 'category' => $slug];
        $response = Http::get('https://bexhilltrading.net/b2b/', $query);
        $body = $response->body();
        $cars = json_decode($body, true);
        $total = $cars['total'];

        $propertyYear = Property::getBySlug('year');
        $carcaseProperty = Property::getBySlug('carcase-type');
        $modelProperty = Property::getBySlug('model');
        $brandProperty = Property::getBySlug('brand');
        $korobkaProperty = Property::getBySlug('korobka');
        $engineVolumeProperty = Property::getBySlug('engine-type');
        $fuelProperty = Property::getBySlug('fuel');
        $mileageProperty = Property::getBySlug('mileage');
        $driveUnitProperty = Property::getBySlug('drive-unit');
        $batteryCapacityProperty = Property::getBySlug('battery-capacity');
        $reserveProperty = Property::getBySlug('power-reserve');
        $stateProperty = Property::getBySlug('state');
        $typeProperty = Property::getBySlug('type');

        while ($total != $current) {
            $query['page_num'] = $paged;

            $response = Http::get('https://bexhilltrading.net/b2b/', $query);
            $body = $response->body();
            $cars = json_decode($body, true);

            $i = 0;
            if ($cars['cars']) {

                $carcasesType = json_decode($carcaseProperty->options, true);

                foreach ($cars['cars'] as $car) {
                    $i++;
                    // Проверяем наличие машины на сайте
                    if (\App\Models\Car::query()->where('slug', $car['slug'])->first()) {
                        continue;
                    }

                    $carParams = [
                        'title' => $car['title'],
                        'slug' => $car['slug'],
                        'sort' => 500,
                        'domain_id' => '6',
                        'description' => $car['description'],
                        'vin' => $car['vin'],
                        'meta_title' => $car['meta_title'],
                        'meta_description' => $car['meta_description'],
                        'active' => 1,
                        'price' => $car['price'],
                        'locale' => 'ru'
                    ];

                    $createdCar = \App\Models\Car::create($carParams);


                    if ($createdCar) {
                        $mainCategory = \App\Models\Category::query()->where('slug', $categorySlug)->first();
                        $createdCar->categories()->attach($mainCategory->id);
                    }

                    // Галерея
                    if (key_exists('images', $car) && count($car['images']) > 0) {
                        $addImages = [];
                        $images = [];
                        foreach ($car['images'] as $key => $image) {
                            $src = file_get_contents($image);
                            $imageName = basename($image);
                            $imagePath = 'products/' . $createdCar->id .'/' . $imageName;
                            $images[] = $imagePath;
                            Storage::disk('public')->put($imagePath, $src);
                        }
                        $createdCar->update([
                            'images' => $images,
                        ]);
                    }

                    // Превью картинка
                    if (key_exists('preview_picture', $car) && strlen($car['preview_picture']) > 0) {
                        $previewPicture = $car['preview_picture'];
                        $src = file_get_contents($previewPicture);
                        $imageName = basename($previewPicture);
                        $imagePath = 'products/' . $createdCar->id .'/' . $imageName;
                        Storage::disk('public')->put($imagePath, $src);
                        $createdCar->update([
                            'preview_image' => $imagePath,
                        ]);
                    }


                    // Реализовать передачу свойств товара

                    foreach ($car['attributes'] as $key => $attribute) {
                        // Марка машины
                        if ($key == 'pa_manufacturer') {
                            $brand = \App\Models\Brand::getBrandByTitle($attribute);
                            if ($brand) {
                                // Добавление марки машины
                                $createdCar->properties()->attach($brandProperty->id, ['slug' => $brand->slug, 'value' => $brand->title]);

                                // Добавление привязки к категории
                                if ($category = \App\Models\Category::query()->where('slug', $brand->slug)->first()) {
                                    $createdCar->categories()->attach($category->id);
                                } else {
                                    $category = \App\Models\Category::create([
                                        'title' => $attribute,
                                        'locale' => 'ru'
                                    ]);
                                    $createdCar->categories()->attach($category->id);
                                }
                            } else {
                                $brand = \App\Models\Brand::create([
                                   'title' =>  $attribute,
                                    'locale' => 'ru'
                                ]);
                                $createdCar->properties()->attach($brandProperty->id, ['slug' => $brand->slug, 'value' => $brand->title]);
                                if ($category = \App\Models\Category::query()->where('slug', $brand->slug)->first()) {
                                    $createdCar->categories()->attach($category->id);
                                } else {
                                    $category = \App\Models\Category::create([
                                        'title' => $attribute,
                                        'locale' => 'ru'
                                    ]);
                                    $createdCar->categories()->attach($category->id);
                                }
                            }
                        }

                        // Модель машины
                        if ($key == 'pa_rumodel') {
                            $model = \App\Models\CarModel::getModelByTitle($attribute);
                            if ($model) {
                                $createdCar->properties()->attach($modelProperty->id, ['slug' => $model->slug, 'value' => $model->title]);
                            } else {
                                $model = \App\Models\CarModel::create([
                                    'title' => $attribute,
                                    'slug' => Str::slug($attribute, '-'),
                                    'locale' => 'ru'
                                ]);
                                $createdCar->properties()->attach($modelProperty->id, ['slug' => $model->slug, 'value' => $model->title]);
                            }
                        }

                        // Год
                        if ($key == 'pa_year-manufacture') {
                            $createdCar->properties()->attach($propertyYear->id, ['slug' => $attribute, 'value' => $attribute]);
                        }

                        // Кузов
                        if ($key == 'pa_body-type') {

                            $carcase = false;
                            foreach ($carcasesType as $type) {
                                if ($type == $attribute) {
                                    $carcase = $type;
                                }
                            }

                            if (!$carcase) {
                                $typeSlug = Property::addOptionToProperty('carcase-type', $attribute);
                                $carcase = ['value' => $attribute, 'slug' => $typeSlug];
                                $carcasesType[] = $carcase;
                            }

                            $createdCar->properties()->attach($carcaseProperty->id, ['slug' => $carcase['slug'], 'value' => $carcase['slug']]);
                        }

                        // Коробка передач
                        if ($key == 'pa_automat') {
                            $machine = ['Автомат', 'Автоматическая', 'авто', 'Робот', 'АКПП'];
                            if (in_array($attribute, $machine)) {
                                $createdCar->properties()->attach($korobkaProperty->id, ['slug' => 'machine', 'value' => 'machine']);
                            } else {
                                $createdCar->properties()->attach($korobkaProperty->id, ['slug' => 'manual', 'value' => 'manual']);
                            }
                        }

                        // Объем двигателя
                        if ($key == 'pa_engine-volume') {
                            $volume = (float)$attribute;
                            $createdCar->properties()->attach($engineVolumeProperty->id, ['slug' => $volume, 'value' => $volume]);
                        }

                        // Тип топлива
                        if ($key == 'pa_oil') {
                            $fuelTypes = [
                                'petrol' => ['Бензин'],
                                'diesel' => ['Дизель', 'DIESEL'],
                                'gas' => ['Газ', 'CONVERTIBLE TO GASEOUS POWERED'],
                                'hybrid' => ['Гибрид', 'HYBRID ENGINE'],
                                'electro' => ['Электро', 'Электрика', 'ELECTRIC'],
                                'gas/benzin' => ['Бензин/Газ', 'Газ/Бензин'],
                            ];

                            $currentFuel = false;

                            foreach ($fuelTypes as $keyFuel => $fuelType) {
                                if (in_array($attribute, $fuelType)) {
                                    $currentFuel = $keyFuel;
                                }
                            }
                            if ($currentFuel) {
                                $createdCar->properties()->attach($fuelProperty->id, ['slug' => $currentFuel, 'value' => $currentFuel]);
                            } else {
                                \Illuminate\Support\Facades\Log::critical('FUEL ERROR: ' . $createdCar->id . ' ' . $attribute);
                            }
                        }

                        // Пробег
                        if ($key == 'pa_speed') {
                            $mileage = preg_replace('/[^0-9]/', '', $attribute);
                            $createdCar->properties()->attach($mileageProperty->id, ['slug' => $mileage, 'value' => $mileage]);

                        }

                        // Привод
                        if ($key == 'pa_drive') {
                            $driveTypes = [
                                'full' => ['4WD', '4x4 с задним приводом', 'All wheel drive', 'AWD', 'Полный', '4x4 w/Front Whl Drv'],
                                'front' => ['Front-wheel Drive', 'Передний привод', 'Передний'],
                                'back' => ['Rear-wheel drive', 'Задний', 'Ремень', 'Цепь', '2WD'],
                            ];
                            $currentDrive = false;
                            foreach ($driveTypes as $keyDrive => $driveType) {
                                if (in_array($attribute, $driveType)) {
                                    $currentDrive = $keyDrive;
                                }
                            }

                            if ($currentDrive) {
                                $createdCar->properties()->attach($driveUnitProperty->id, ['slug' => $currentDrive, 'value' => $currentDrive]);
                            } else {
                                \Illuminate\Support\Facades\Log::critical('DRIVE ERROR: ' . $createdCar->id . ' ' . $attribute);
                            }

                        }

                        // Емкость батареи
                        if ($key == 'pa_ruyomkost-batarei') {
                            $capacity = (float)$attribute;
                            $createdCar->properties()->attach($batteryCapacityProperty->id, ['slug' => $capacity, 'value' => $capacity]);
                        }

                        // Запас хода
                        if ($key == 'pa_ruzapas-hoda') {
                            $reserve = (int)$attribute;
                            $createdCar->properties()->attach($reserveProperty->id, ['slug' => $reserve, 'value' => $reserve]);
                        }

                        // Состояние
                        if ($key == 'pa_condition') {
                            $stateTypes = [
                                'new' => ['New', 'Новый'],
                                'used' => ['б/у', 'бу', 'С пробегом'],
                            ];

                            $currentState = false;
                            foreach ($stateTypes as $keyState => $stateType) {
                                if (in_array($attribute, $stateType)) {
                                    $currentState = $keyState;
                                }
                            }

                            if ($currentState) {
                                $createdCar->properties()->attach($stateProperty->id, ['slug' => $currentState, 'value' => $currentState]);
                            } else {
                                \Illuminate\Support\Facades\Log::critical('STATE ERROR: ' . $createdCar->id . ' ' . $attribute);
                            }
                        }
                    }

                    // По умолчанию если не указано состояние устанавливать "с пробегом"
                    if (!key_exists('pa_condition', $car['attributes'])) {
                        $createdCar->properties()->attach($stateProperty->id, ['slug' => 'used', 'value' => 'used']);
                    }

                    if ($categorySlug == 'motorcycles') {
                        $createdCar->properties()->attach($typeProperty->id, ['slug' => 'moto', 'value' => 'moto']);
                    } elseif ($categorySlug == 'pogruzchiki') {
                        $createdCar->properties()->attach($typeProperty->id, ['slug' => 'truck', 'value' => 'truck']);
                    } else {
                        $createdCar->properties()->attach($typeProperty->id, ['slug' => 'auto', 'value' => 'auto']);
                    }

                    if ($i == 10) {
                        dd($cars['cars']);
                    }
                }


                $current += count($cars['cars']);
                $paged++;
            } else {
                break;
            }

        }


    }

});

Route::get('/test', function () {
    // Чтобы сработало нужно закомментить трейты в моделе CarProperty
    $cars = \App\Models\Car::query()->get();
    foreach ($cars as $car) {
        $carProperty = \App\Models\CarProperty::query()
            ->where('car_id', $car->id)->where('property_id', 2)->first();
        $model = \App\Models\CarModel::query()->where('title->ru', $carProperty->value)->first();
        if ($model) {
            dump($model->slug, $carProperty->id);
            $carProperty->slug = $model->slug;
//            dump($res);
            $res = $carProperty->save();
            dump($res);
        }
//        dump($carProperty);
    }
//    $res = App\Models\CarModel::getBySlug('');
//    dd($res);
});

// Sub-domains
$domains = Domain::all();
$domains->each(function ($domain) {
    Route::group([
        'prefix' => LaravelLocalization::setLocale(),
        'domain' => $domain->slug . env('APP_DOMAIN'),
    ], function () {
        commonRoute();
    });
});

// Main domain
Route::group([
    'prefix' => LaravelLocalization::setLocale(),
], function () {
    commonRoute();
});

function commonRoute()
{

    // Services
    Route::get('/uslugi/{service}', [\App\Http\Controllers\ServiceController::class, 'service'])->name('service');

    // Car detail
    Route::get('/car-details/{car}', [\App\Http\Controllers\CardController::class, 'index'])->name('car_detail');

    // Categories
    Route::get(
        '/avto/{category}/{page?}/{filer?}',
        [\App\Http\Controllers\CatalogController::class, 'category']
    )->name('category');

    // Search
    Route::get('/search', [\App\Http\Controllers\SearchController::class, 'search'])->name('search');

    // Thanks
    Route::get('/thanks', [\App\Http\Controllers\IndexController::class, 'thanks'])->name('thanks');

    Route::group(['prefix' => '/about'], function () {

        Route::get('/', [\App\Http\Controllers\IndexController::class, 'staticPage'])->name('static.about');

        // News
        Route::get('/news', [\App\Http\Controllers\NewsController::class, 'index'])->name('news');

        // News detail
        Route::get('/news/{article}', [\App\Http\Controllers\NewsController::class, 'detail'])->name('news_detail');

        // Guarantee
        Route::get('/guarantee', [\App\Http\Controllers\IndexController::class, 'staticPage'])->name('static.guarantee');

        // Contacts
        Route::get('/contacts', [\App\Http\Controllers\IndexController::class, 'staticPage'])->name('static.contacts');
    });

    Route::get('/privacy-policy', [\App\Http\Controllers\IndexController::class, 'staticPage'])->name('static.privacy');

    Route::get('/reviews-list', ReviewsController::class);

    // Index
    Route::get('/{city?}', [\App\Http\Controllers\IndexController::class, 'index'])->name('index');
}

// Admin actions
Route::group(['middleware' => ['admin']], function () {
    // Cache delete
    Route::get('/cache/clear', function () {
        Artisan::call("cache:clear");
    })->name('clear-cache');

    // Parser
    Route::post('parser/save', [\App\Http\Controllers\Admin\ParserController::class, 'save'])->name('save-parser-info');
    Route::get('parser/download', [\App\Http\Controllers\Admin\ParserController::class, 'download'])->name('download-lots');
    Route::get('parser/queue-info', [\App\Http\Controllers\Admin\ParserController::class, 'infoForAjax'])->name('parser-queue-info');
    Route::post('parser/delete', [\App\Http\Controllers\Admin\ParserController::class, 'deleteQueue'])->name('delete-queue');
});


// Роуты на вёрстку
Route::group(['prefix' => 'html'], function () {
    Route::get('/links', function () {
        return view('html.links');
    })->name('html.links');
    Route::get('/index', function () {
        return view('html.index');
    })->name('html.index');
    Route::get('/catalog', function () {
        return view('html.catalog');
    })->name('html.catalog');
    Route::get('/card', function () {
        return view('html.card');
    })->name('html.card');
    Route::get('/dealer-services', function () {
        return view('html.dealer-services');
    })->name('html.dealer-services');
    Route::get('/new-elektromobili', function () {
        return view('html.new-elektromobili');
    })->name('html.new-elektromobili');
    Route::get('/elektromobili', function () {
        return view('html.elektromobili');
    })->name('html.elektromobili');
    Route::get('/delivery', function () {
        return view('html.delivery');
    })->name('html.delivery');
    Route::get('/news', function () {
        return view('html.news');
    })->name('html.news');
    Route::get('/article', function () {
        return view('html.article');
    })->name('html.article');
    Route::get('/contacts', function () {
        return view('html.contacts');
    })->name('html.contacts');
    Route::get('/guarantee', function () {
        return view('html.guarantee');
    })->name('html.guarantee');
    Route::get('/thanks-order', function () {
        return view('html.thanks-order');
    })->name('html.thanks-order');
    Route::get('/search', function () {
        return view('html.search');
    })->name('html.search');
    Route::get('/about', function () {
        return view('html.about');
    })->name('html.about');
});
