<?php

return [
    'dropzone' => [
        'drop_to_upload' => 'Перетащите сюда файлы для загрузки',
        'remove_file' => 'Удалить файл'
    ],

    'active' => 'Активность',
    'symbol_code' => 'Символьный код',
    'field_type' => 'Тип поля',
    'menu_items' => 'Пункты меню',
    'menu_item' => 'Пункт меню',
    'title' => 'Заголовок',
    'description' => 'Описание',
    'link' => 'Ссылка',
    'sort' => 'Сортировка',
    'image' => 'Картинка',
    'city' => 'Город',
    'address' => 'Адрес',
    'phone' => 'Телефон',
    'subtitle' => 'Подзаголовок',
    'text' => 'Текст',
    'slug' => 'Символьный код',
    'images' => 'Изображения',
    'price' => 'Цена',
    'info' => 'Информация',
    'status' => 'Статус',
    'category' => 'Раздел',
    'categories' => 'Разделы',
    'show_in_slider' => 'Показать в слайдере',
    'year' => 'Год выпуска',
    'question' => 'Вопрос',
    'answer' => 'Ответ',
    'pin' => 'Закрепить машину в популярных авто',
    'default' => 'Выводить по умолчанию',
    'faq' => 'Вопросы и ответы',
    'seo_text' => 'Сео текст',
    'main' => 'Сео текст для всех страниц',
    'brand' => 'Марка',
    'name' => 'Наименование',
    'filter_type' => 'Тип поля в фильтре',

    'option' => [
        'expect' => 'Ожидается',
        'in_stock' => 'В наличии',
        'on_order' => 'Под заказ',
    ]
];