<?php
return [
    'info' => 'Описание состояния при наведении на значок i',

    'faqs' => [
        'default' => 'Вопрос-ответ по умолчанию (выводится на всех страницах где есть этот блок )'
    ],

    'categories' => [
        'faqs' => 'Вопросы и ответы которые выводятся на странице текущей категории'
    ],

    'properties' => [
        'slug' => 'Будет автоматически сгенерирован из наименования, если оставить поле пустым'
    ],

    'cars' => [
        'youtube_link' => 'Id видео на ютуб ex: "6AnSRR5ltvk"'
    ]
];