<?php

return [
    'branch' => 'Our branches',
    'price' => 'Бәсекеге қабілетті бағалар',
    'cabinet' => 'Көліктерге тапсырыс беруге және қадағалауға арналған жеке кабинет',
    'garantee' => 'Компанияның қызметтеріне кепілдіктер',
    'cabinet_title' => 'Bex Auto клиентінің жеке кабинеті:',
    'list' => [
        'l1' => 'Украинаға жеткізу кезінде көлікті қадағалаңыз',
        'l2' => 'Барлық көліктердегі көлік күйін бақылау',
        'l3' => 'Төлем жасау және төлемдерді қадағалау',
        'l4' => 'Аукциондар үшін төлем',
    ],

    'benefits' => [
        '1' => 'Бәсекеге қабілетті бағалар',
        '2' => 'Көліктерге тапсырыс беруге және қадағалауға арналған жеке кабинет',
        '3' => 'Компанияның қызметтеріне кепілдіктер',
    ]
];