<?php
return [
    'title' => 'Танымал автомобильдер',
    'default_h1' => ':title',
    'sort' => [
        'price_desc' => 'Қымбаттан арзанға',
        'price_asc' => 'Арзаннан қымбатқа',
        'id_desc' => 'Тазалаудан кейін сұрыптау',
    ],

    'filter' => [
        'price' => 'АҚШ долларындағы баға',
        'form' => 'Бастап',
        'to' => 'Бұрын'
    ],

    'form' => [
        'form_title' => 'Өтінім қалдырыңыз, біз сіздің бюджетіңіз бен сұранысыңызға сәйкес көлік алып береміз',
    ],
];
