<?php
return [
    'call_back_title' => 'Сұраныс қалдырыңыз, біз сіздің бюджетіңізге және сұранысыңызға сәйкес көлік табамыз',
    'name' => 'Аты',
    'car' => 'Қалаулы көлік',
    'country' => 'Автокөліктің шыққан елі',
    'call_back_button' => 'Көлік алу',
    'buy-and-delivery' => [
        'title' => 'Арманыңыздағы көлікті табайық!',
        'sub_title' => 'Өтінім қалдырыңыз, біздің менеджерлер сіздің бюджетіңізге және сұранысыңызға сәйкес көлік таңдайды',
        'submit' => 'Көлікке тапсырыс беру',
    ],

    'order-calc' => [
        'title' => '<span class="color-blue">көлігіңізді сатып алу және жеткізу</span> үшін бағаға тапсырыс беріңіз',
        'sub_title' => 'Телефон нөміріңізді енгізіңіз, біздің менеджер сізбен байланысады',
        'submit' => 'Тапсырысты есептеу',
    ],

    'partners' => [
        'title' => '<span class="color-blue">Bexhill Trading Auto</span> серіктесі болыңыз',
    ],

    'discount' => [
        'btn' => 'Жіберу',
    ]
];