<?php
return [
    'title' => 'Bex Auto',

    'popular_request_title' => 'Танымал сұрау',
    'buy-and-delivery' => [
        'title' => 'Автокөлік сатып алу және жеткізу қызметтері',
        'sub_title' => 'Біз сіздің бюджетіңізге сәйкес келетін көлік<br> алып, әкелеміз!',
        'text' => 'Сіз бізбен әлемнің түкпір-түкпірінен көліктерге тапсырыс бере аласыз:',
        'countries' => 'АҚШ, Канада, Корея, Қытай, Грузия.',
    ],

    'offer' => [
        'title' => 'Бірінші болып тамаша<br> <span class="color-red">авто мәмілелер алыңыз!</span>',
        'sub_title' => 'Біздің қауымдастықтарда дәйексөздерді, бейне шолуларын<br> және тұтынушылардың пікірлерін жариялау.',
    ],


    'partner' => [
        'title' => '<span class="color-red">Бексхилл</span> <span class="color-blue">Сауда</span> Auto — Copart және IAAI американдық аукциондарының ресми серіктесі'
    ],

    'services' => [
        'title' => 'Біз кілт тапсыру қызметтерін көрсетеміз:',
        'block_1' => [
            'title' => 'Сатып алу',
            'li1' => 'Аукционда автокөліктерді сатып алу шарт жасасқаннан кейін және клиент аванстық соманы төлегеннен кейін жүзеге асырылады. Аванстық төлем компанияның ағымдағы шотына SWIFT төлемі арқылы сауда басталғанға дейін төленеді.',
            'li2' => 'Сатып алғаннан кейін шот-фактура төленеді (АҚШ-тағы көлік құны + аукциондық комиссия).',
            'li3' => 'Шот-фактура SWIFT төлемі арқылы доллармен автокөлік сатып алғаннан кейін келесі күні төленеді.',
        ],
        'block_2' => [
            'title' => 'Жеткізу',
            'sub_title' => 'Біз өзімізге ұнайтын көлікті АҚШ-тан сатып аламыз (қаласаңыз таңдауға көмектесеміз, нюанстарды айтамыз), оны Америка портынан (Нью-Йорк, Чикаго, Саванна) жібереміз. , Майами, Лос-Анджелес, Норфолк немесе Торонто). Біз теңіз арқылы тасымалдаймыз, жүкті жолдағы келеңсіздіктерден сақтандырамыз, кедендік және басқа да құжаттарды рәсімдейміз.',
        ],
        'block_3' => [
            'title' => 'Кедендік ресімдеу',
            'sub_title' => 'Біз өзімізге ұнайтын көлікті АҚШ-тан сатып аламыз (қаласаңыз таңдауға көмектесеміз, нюанстарды айтамыз), оны Америка портынан (Нью-Йорк, Чикаго, Саванна) жібереміз. , Майами, Лос-Анджелес, Норфолк немесе Торонто). Біз теңіз арқылы тасымалдаймыз, жүкті жолдағы келеңсіздіктерден сақтандырамыз, кедендік және басқа да құжаттарды рәсімдейміз.',
        ]
    ],

    'reviews' => [
        'title' => 'Олар <span class="bline">біз</span> туралы айтады',
        'sub_title' => 'Жұмысымыз туралы әрбір пікір біз үшін маңызды',
        'more' => 'Барлық шолуларды көру',
    ],

    'why_we' => [
        'title' => 'Неге бізді <span class="color-blue"><span class="bline">5000</span> клиент</span> артық таңдады',
        'why_1' => 'Көліктер әкелдім',
        'why_2' => 'Көлік тәжірибесі',
        'why_3' => 'Халықаралық көлік тәжірибесі көп жылдар',
        'why_4' => 'Өз автосалондары',
        'why_5' => 'Сатып алу алдындағы тексерулер',
        'why_6' => 'Әртүрлі мамандар',
        'years' => ':num years'
    ],

    'faqs' => [
        'title' => 'Сұрақтарға жауап берілді',
    ],

    'seo_text' => [
        'btn_show' => 'Мәліметтер',
        'btn_close' => 'Жабу',
    ],

    'search' => [
        'placeholder' => 'Көліктің маркасын немесе үлгісін енгізіңіз'
    ],

    'popular' => [
        'title' => 'Танымал автомобиль брендтері',
        'көбірек' => 'Қосымша'
    ],

    'thanks' => [
        'title' => 'Жібергеніңіз үшін рақмет!',
        'description' => 'Жібергеніңіз үшін рахмет!',
        'text' => 'Менеджеріміз сізге жақын арада хабарласады. <br> Осы уақытта сіз біздің тұтынушыларымыздың пікірлерін көре аласыз,',
        'btn-back' => 'Артқа',
        'btn-reviews' => 'Тұтынушы пікірлері',
    ],

    'from_country' => '',
];
