<?php
return [
    'guarantee' => [
        'breadcrumbs' => 'Кепілдіктер',
        'title' => 'Кепілдіктер',
        'sub_title' => 'Bexhill Trading Auto АҚШ-тан көлік сатып алғанда толық жауапкершілікке кепілдік береді.',
        'for_auto' => 'АҚШ автокөпілдіктері:'
    ],
    'about' => [
        'breadcrumbs' => 'Компания туралы',
    ],
    'contacts' => [
        'breadcrumbs' => 'Контактілер',
        'schedule' => 'Компанияның жұмыс кестесі:',
        'weekdays' => 'Дүйсенбі-жұма 09:00-ден 20:00-ге дейін',
        'weekends' => 'Сенбі-жексенбі 09:00-ден 18:00-ге дейін.',
    ],

];