<?php

namespace App\Models;

use Backpack\CRUD\app\Models\Traits\CrudTrait;
use Illuminate\Database\Eloquent\Model;

class FormResult extends Model
{
    use CrudTrait;

    const FORM_NAMES = [
        'order_calculate' => 'Расчет стоимости',
        'buy_and_delivery' => 'Услуги приобретения и доставки авто',
        'call_back' => 'Обратной связи',
        'discount' => 'Получить скидку',
        'application_for_credit' => 'Заявка на покупку авто в Кредит',
        'buy_car_from' => 'Заявка на покупку авто',
    ];

    /*
    |--------------------------------------------------------------------------
    | GLOBAL VARIABLES
    |--------------------------------------------------------------------------
    */

    protected $table = 'form_results';
    protected $guarded = ['id'];
     protected $fillable = ['slug_form', 'name', 'phone', 'car', 'country', 'utm_source', 'utm_medium', 'utm_campaign'];

    /*
    |--------------------------------------------------------------------------
    | FUNCTIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | RELATIONS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | SCOPES
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | ACCESSORS
    |--------------------------------------------------------------------------
    */

    /*
    |--------------------------------------------------------------------------
    | MUTATORS
    |--------------------------------------------------------------------------
    */
}
