<?php

return [
    'price' => 'Конкурентоспособные цены',
    'cabinet' => 'Личный кабинет для заказа и отслеживания авто',
    'guarantee' => 'Гарантии на услуги компании',
    'cabinet_title' => 'Личный кабинет клиента Bex Auto позволяет:',
    'list' => [
        'l1' => 'Отслеживать авто при доставке в Украину',
        'l2' => 'Контролировать состояние авто на всех авто',
        'l3' => 'Оплачивать и отслеживать оплаты',
        'l4' => 'Оплачивать аукционы',
    ],

    'benefits' => [
        '1' => 'Конкурентоспособные цены',
        '2' => 'Личный кабинет для заказа и отслеживания авто',
        '3' => 'Гарантии на услуги компании',
    ]
];