<?php
return [
    'call_back_title' => 'Оставляй заявку и мы подберем авто под ваш бюджет и запрос',
    'name' => 'Имя',
    'car' => 'Желательное авто',
    'country' => 'Страна происхождения авто',
    'call_back_button' => 'Подобрать авто',
    'buy-and-delivery' => [
        'title' => 'Найдем авто вашей мечты!',
        'sub_title' => 'Оставляйте заявку и наши менеджеры подберут авто под ваш бюджет и запрос',
        'submit' => 'Заказать авто',
    ],

    'order-calc' => [
        'title' => 'Закажите расчет стоимости <span class="color-blue">приобретение и доставка вашего авто</span>',
        'sub_title' => 'Укажите ваш телефон и наш менеджер свяжется с вами',
        'submit' => 'Заказать расчет',
    ],

    'partners' => [
        'title' => 'Станьте партнером <span class="color-blue">Bexhill Trading Auto</span>',
    ],

    'discount' => [
        'btn' => 'Отправить',
    ]
];