<?php
return [
    'title' => 'Bex Auto',

    'popular_request_title' => 'Популярні запити',
    'buy-and-delivery' => [
        'title' => 'Услуги приобретения и доставки авто',
        'sub_title' => 'Подберем и привезем авто<br> под ваш бюджет!',
        'text' => 'У нас вы можете заказать авто из разных стран мира:',
        'countries' => 'США, Канада, Корея, Китай, Грузия.',
    ],

    'offer' => [
        'title' => 'Получай первым выгодные<br> <span class="color-red">предложения авто!</span>',
        'sub_title' => 'Публикуем расчеты стоимости, видеообзоры<br> и отзывы клиентов в наших сообществах.',
    ],


    'partner' => [
        'title' => '<span class="color-red">Bexhill</span> <span class="color-blue">Trading</span> Auto – офіційний партнер американських<br> аукціонів  Copart и IAAI'
    ],

    'services' => [
        'title' => 'Предоставляем услуги под ключ:',
        'block_1' => [
            'title' => 'Покупка',
            'li1' => 'Покупка автомобилей на аукционе осуществляется после заключения договора и оплаты клиентом авансовой суммы. Аванс вносится на расчётный счёт компании SWIFT-платежом перед началом торгов.',
            'li2' => 'После покупки осуществляется оплата инвойса (стоимость авто в США + сбор аукциона).',
            'li3' => 'Инвойс оплачивается на следующий день после покупки авто в долларах SWIFT-платежом.',
        ],
        'block_2' => [
            'title' => 'Доставка',
            'sub_title' => 'Мы купим понравившееся авто из США (поможет выбрать при желании, подскажем нюансы), отправим его из порта в Америке (Нью-Йорк, Чикаго, Саванна, Майами, Лос-Анджелес, Норфолк или Торонто). Транспортируем по морю, застрахуем груз от неприятностей в дороге, оформим таможенные и другие документы.',
        ],
        'block_3' => [
            'title' => 'Таможенное оформление',
            'sub_title' => 'Мы купим понравившееся авто из США (поможет выбрать при желании, подскажем нюансы), отправим его из порта в Америке (Нью-Йорк, Чикаго, Саванна, Майами, Лос-Анджелес, Норфолк или Торонто). Транспортируем по морю, застрахуем груз от неприятностей в дороге, оформим таможенные и другие документы.',
        ]
    ],

    'reviews' => [
        'title' => 'О <span class="bline">нас</span> говорят',
        'sub_title' => 'Для нас важен каждый отзыв о нашей работе',
        'more' => 'Смотреть все отзывы',
        'more_video' => 'Смотрите больше отзывов в нашем Instagram',
    ],

    'why_we' => [
        'title' => 'Почему нас выбрали более <span class="color-blue"><span class="bline">5000</span> клиентов</span>',
        'why_1' => 'Привезенных автомобилей',
        'why_2' => 'Опыта транспортных перевозок',
        'why_3' => 'Лет опыта транспортных международных перевозок',
        'why_4' => 'Собственных салонов авто',
        'why_5' => 'Этапов проверки перед покупкой',
        'why_6' => 'Разнопрофильных профессионалов',
        'years' => ':num лет'
    ],

    'faqs' => [
        'title' => 'Ответы на вопросы',
    ],

    'seo_text' => [
        'btn_show' => 'Детальнее',
        'btn_close' => 'Свернуть',
    ],

    'search' => [
        'placeholder' => 'Введите модель или марку авто'
    ],

    'popular' => [
        'title' => 'Популярные марки авто',
        'more' => 'Детальнее'
    ],

    'thanks' => [
        'title' => 'Спасибо за заявку!',
        'description' => 'Спасибо за заявку!',
        'text' => 'Наш менеджер свяжется с вами в ближайшее время. <br> А пока можете посмотреть отзывы наших клиентов',
        'btn-back' => 'Назад',
        'btn-reviews' => 'Отзывы клиентов',
    ],

    'from_country' => 'из',
];
