<?php
return [
    'popular_request_title' => 'Популярні запити',
    'buy-and-delivery' => [
        'title' => 'Услуги приобретения и доставки авто',
        'sub_title' => 'Подберем и привезем авто<br> под ваш бюджет!',
        'text' => 'У нас вы можете заказать авто из разных стран мира:',
        'countries' => 'США, Канады, Кореи, Китая, Грузии.',
    ],

    'offer' => [
        'title' => 'Получай первым выгодные<br> <span class="color-red">предложения авто!</span>',
        'sub_title' => 'Публикуем расчеты стоимости, видеообзоры<br> и отзывы клиентов в наших сообществах.',
    ],
];