<?php

return [
    'price' => 'Конкурентоспроможні ціни',
    'cabinet' => 'Особистий кабінет для замовлення та відстежування авто',
    'guarantee' => 'Гарантії на послуги компанії',
    'cabinet_title' => 'Особистий кабінет клієнта Bex Auto дозволяє:',
    'list' => [
        'l1' => 'Відслідковувати авто під час доставки в Україну',
        'l2' => 'Контролювати стан авто на всіх авто',
        'l3' => 'Здійснювати оплату та відслідковувати оплати',
        'l4' => 'Оплачувати аукціони',
    ]
];