<?php
return [
    'call_back_title' => 'Залишай заявку і ми підберемо авто під ваш бюджет та запит',
    'name' => 'Ім`я',
    'car' => 'Бажане авто',
    'country' => 'Страна походження авто',
    'call_back_button' => 'Підібрати авто',
    'buy-and-delivery' => [
        'title' => 'Знайдемо авто вашої мрії!',
        'sub_title' => 'Залишайте заявку та наші менеджери підберуть авто під ваш бюджет та запит',
        'submit' => 'Замовити авто',
    ],


    'order-calc' => [
        'title' => 'Замовте розрахунок вартості <span class="color-blue">придбання та доставки вашого авто</span>',
        'sub_title' => 'Вкажіть ваш телефон та наш менеджер зв\'яжеться з вами',
        'submit' => 'Замовити розрахунок',
    ],

    'partners' => [
        'title' => 'Стати партнером <span class="color-blue">Bexhill Trading Auto</span>',
    ],

    'discount' => [
        'btn' => 'Надіслати',
    ]
];