<?php
return [
    'popular_request_title' => 'Популярные запросы',
    'buy-and-delivery' => [
        'title' => 'Послуги придбання та доставки авто',
        'sub_title' => 'Підбермо та привеземо авто<br> під ваш бюджет!',
        'text' => 'У нас ви можете замовити авто з різних країн світу:',
        'countries' => 'США, Канади, Кореї, Китаю, Грузії.',
    ],

    'offer' => [
      'title' => 'Отримуй першим вигідні<br> <span class="color-red">пропозиції авто!</span>',
      'sub_title' => 'Публікуємо розрахунки вартості, відеоогляди<br> та відгуки клієнтів в наших спільнотах.',
    ],
];