<?php
return [
    'title' => 'Bexhill Trading Auto',

    'popular_request_title' => 'Популярные запросы',
    'buy-and-delivery' => [
        'title' => 'Послуги придбання та доставки авто',
        'sub_title' => 'Підбермо та привеземо авто<br> під ваш бюджет!',
        'text' => 'У нас ви можете замовити авто з різних країн світу:',
        'countries' => 'США, Канади, Кореї, Китаю, Грузії.',
    ],

    'offer' => [
        'title' => 'Отримуй першим вигідні<br> <span class="color-red">пропозиції авто!</span>',
        'sub_title' => 'Публікуємо розрахунки вартості, відеоогляди<br> та відгуки клієнтів в наших спільнотах.',
    ],

    'partner' => [
        'title' => '<span class="color-red">Bexhill</span> <span class="color-blue">Trading</span> Auto – офіційний партнер американських<br> аукціонів  Copart и IAAI'
    ],

    'services' => [
        'title' => 'Надаємо послуги під ключ:',
        'block_1' => [
            'title' => 'Покупка',
            'li1' => 'Покупка авто на аукционе осуществляется после заключения договора и оплаты клиентом авансовой суммы. Аванс вносится на расчётный счёт компании SWIFT-платежом перед началом торгов.',
            'li2' => 'После покупки осуществляется оплата инвойса (стоимость авто в США + сбор аукциона).',
            'li3' => 'Инвойс оплачивается на следующий день после покупки авто в долларах SWIFT-платежом.',
        ],
        'block_2' => [
            'title' => 'Доставка',
            'sub_title' => 'Мы купим понравившееся авто из США (поможет выбрать при желании, подскажем нюансы), отправим его из порта в Америке (Нью-Йорк, Чикаго, Саванна, Майами, Лос-Анджелес, Норфолк или Торонто). Транспортируем по морю, застрахуем груз от неприятностей в дороге, оформим таможенные и другие документы.',
        ],
        'block_3' => [
            'title' => 'Митне оформлення',
            'sub_title' => 'Мы купим понравившееся авто из США (поможет выбрать при желании, подскажем нюансы), отправим его из порта в Америке (Нью-Йорк, Чикаго, Саванна, Майами, Лос-Анджелес, Норфолк или Торонто). Транспортируем по морю, застрахуем груз от неприятностей в дороге, оформим таможенные и другие документы.',
        ]
    ],

    'reviews' => [
        'title' => 'Про <span class="bline">нас</span> говорять',
        'sub_title' => 'Для нас важливий кожен відгук про нашу роботу',
        'more' => 'Дивитись усі відгуки',
    ],

    'why_we' => [
        'title' => 'Чому нас обрали понад <span class="color-blue"><span class="bline">5000</span> клієнтів</span>',
        'why_1' => 'Привезених автомобілів',
        'why_2' => 'Досвіду транспортних перевезень',
        'why_3' => 'Років досвіду транспортних міжнародних перевезень',
        'why_4' => 'Власних салонів авто',
        'why_5' => 'Етапів перевірки перед покупкою',
        'why_6' => 'Різнпрофільних професіоналів',
        'years' => ':num років'
    ],

    'faqs' => [
        'title' => 'Відповіді на питання',
    ],

    'seo_text' => [
        'btn_show' => 'Детальніше',
        'btn_close' => 'Згорнути',
    ],


    'search' => [
        'placeholder' => 'Введіть модель марку авто'
    ],

    'popular' => [
        'title'  => 'Популярні марки авто',
        'more' => 'Детальніше'
    ],

    'thanks' => [
        'title' => 'Дякую за заявку!',
        'description' => 'Дякую за заявку!',
        'text' => 'Наш менеджер зв\'яжеться з вами найближчим часом. <br> А поки що можете переглянути відгуки наших клієнтів',
        'btn-back' => 'Назад',
        'btn-reviews' => 'Відгуки клієнтів',
    ],
];